{
  "about": {
    "1": "Hallo, ich bin Johann, Bsc. Informatik Student aus Hessen, Deutschland. Ich interessiere mich für Frontend und Nutzerorientierte Entwicklung.",
    "2": "Seit mehr als zwei Jahren nutze ich [Flutter](https://flutter.dev), womit ich auch diese Seite entwickelt habe.",
    "3": "Wie man vielleicht erraten kann, ist meine aktuell meist genutzte sowie also auch Lieblingssprache [Dart](https://dart.dev), die Sprache die Flutter nutzt.",
    "4": "Neben Flutter und Dart habe ich noch Erfahrung in Java, was meine erste Sprache war, mit der ich mich Intensive beschäftigt habe, Python welche ich für meinen Nebenjob nutze und Typescript/JavaScript für Angular und NodeJs Programme. Und ich habe Erfahrung mit [Firebase](https://firebase.google.com). Besonders mit Firebase Realtime Database, Firestore, Cloud Functions und Cloud Messaging.",
    "5": "Nebenberuflich habe ich an meiner Universität im Fachgebiet [Theoretische Informatik / Komplexe Systeme](http://www.uni-kassel.de/eecs/fachgebiete/tiks/about.html) als Tutor für die Vorlesung Einführung in die Informatik gearbeitet (WS18/19 und WS19/20)."
  },
  "oi": "Nur am rande, ich habe etwas was sich Osteogenesis imperfecta (OI) oder umgangssprachlich Glasknochen Krankheit nennt. Zu den Symptomen zählen unteranderem, wie der Name suggeriert zerbrechliche und deformierte Knochen und Kleinwuchs.",
  "oi_more": "Wenn du mehr darüber erfahren willst, sind hier ein paar Links.",
  "contact": "Wenn du mich kontaktieren willst, schreib mir eine [Email](mailto:johannfeser@gmail.com)",
  "menu": {
    "menu": "Menü",
    "home": "Home",
    "projects": "Projekte",
    "contact": "Kontakt"
  },
  "projects": {
    "desc": "Most of my work can be found on [Github](https://github.com/johann13). Not all of my repos are public but I'm in the process of making some of them public. Here is a list of some of my public work.",
    "list": [
      {
        "title": "YcApp - Unoffical Yogscast App",
        "desc": "A Flutter app designed to be an App for everything [Yogscast](http://yogscast.com). It shows all relevant infos about them like channel, social media links and schedules. It can also send notifications whenever a new Youtube video is uploaded or twitch stream goes live. And in case of the [Main Channel](https://twitch.tv/yogscast) it sends them 10 minutes before a stream is supposed to start. There are three companion sites all also built using Flutter, [yogs.app](https://yogs.app), [schedule.yogs.app](https://schedule.yogs.app) and [jj.yogs.app](https://jj.yogs.app). The Code is not publicly available although i'm considering open sourcing parts of it.",
        "link": "https://yogs.app"
      },
      {
        "title": "Car2P - Flutter App",
        "desc": "This was a Uni Project I worked on for about 6 Months (May - October 2019). A Flutter App + Backend that can track users position and detect possible collisions. The Goal of this project was not only developing this app and the needed backend but also to evaluate if this project is a good usecase for Flutter. The Code is not publicly available."
      },
      {
        "title":"Simple 2D Planetarium",
        "desc":"This is a very simplified Planetarium. It shows the motion of the 8 Planets in the Solar System relative to each other. The Site is hosted [here](https://johann13.github.io/simple_2d_planetarium/#/).",
        "link": "https://github.com/Johann13/simple_2d_planetarium"
      },
      {
        "title": "Flutter Web Util",
        "desc": "Flutter for Web specific widgets.",
        "link": "https://github.com/Johann13/flutter_web_util"
      },
      {
        "title": "Flutter Async Builder",
        "desc": "Convenience widgets for [Future](https://api.flutter.dev/flutter/widgets/FutureBuilder-class.html) and [Stream](https://api.flutter.dev/flutter/widgets/StreamBuilder-class.html) Builder",
        "link": "https://github.com/Johann13/flutter_async_builder"
      },
      {
        "title": "Screen Size Util",
        "desc": "Flutter widget for responsive layouts and extensions to [MediaQueryData](https://api.flutter.dev/flutter/widgets/MediaQueryData-class.html).",
        "link": "https://github.com/Johann13/screen_size_util"
      },
      {
        "title": "This Site",
        "desc": "Just a portfolio site.",
        "link": "https://github.com/Johann13/personal_website"
      }
    ]
  }
}